[
    {
        "Id": "1",
        "Name": "Espaguete com tomatinhos cereja e manjericão",
        "Description": "Uma receita simples e deliciosa de espaguete com tomatinhos cereja frescos e manjericão.",
        "CategoryIds": ["1"],
        "ImagePath": "https://images.pexels.com/photos/11654225/pexels-photo-11654225.jpeg",
        "Ingredients": [
            "200g de espaguete",
            "300g de tomatinhos cereja cortados ao meio",
            "2 dentes de alho picados",
            "3 colheres de sopa de azeite de oliva",
            "1/2 xícara de folhas de manjericão fresco",
            "Sal e pimenta a gosto",
            "Queijo parmesão ralado a gosto"
        ],
        "Instructions": [
            "Cozinhe o espaguete em água salgada conforme as instruções da embalagem até ficar al dente.",
            "Enquanto isso, aqueça o azeite em uma frigideira grande e refogue o alho até dourar levemente.",
            "Adicione os tomatinhos cereja e cozinhe por cerca de 5 minutos, até começarem a amolecer.",
            "Tempere com sal e pimenta a gosto.",
            "Escorra o espaguete e adicione à frigideira com os tomates.",
            "Misture bem, adicione o manjericão e mexa rapidamente.",
            "Sirva com queijo parmesão ralado por cima."
        ],
        "New": false,
        "UserId": "123456"
    },
    {
        "Id": "2",
        "Name": "Toast de avocado com ovos cozidos",
        "Description": "Uma opção deliciosa e saudável de café da manhã ou lanche, com fatias de pão tostado, avocado cremoso e ovos cozidos.",
        "CategoryIds": ["2", "3"],
        "ImagePath": "https://images.pexels.com/photos/566566/pexels-photo-566566.jpeg",
        "Ingredients": [
            "2 fatias de pão integral",
            "1 avocado maduro",
            "2 ovos",
            "1 colher de chá de suco de limão",
            "Sal e pimenta a gosto",
            "Folhas de coentro ou salsinha para decorar"
        ],
        "Instructions": [
            "Cozinhe os ovos em água fervente por cerca de 8 a 10 minutos, até que fiquem duros. Descasque e corte ao meio.",
            "Enquanto os ovos cozinham, torre as fatias de pão até ficarem douradas e crocantes.",
            "Amasse o avocado em uma tigela com o suco de limão, e tempere com sal e pimenta a gosto.",
            "Espalhe o avocado amassado sobre as fatias de pão torrado.",
            "Coloque as metades dos ovos cozidos sobre o avocado e finalize com folhas de coentro ou salsinha.",
            "Sirva imediatamente."
        ],
        "New": true,
        "UserId": "654321"
    },
    {
        "Id": "3",
        "Name": "Macarons",
        "Description": "Delicados biscoitos franceses com uma casquinha crocante e recheio cremoso, perfeitos para sobremesas e ocasiões especiais.",
        "CategoryIds": ["4"],
        "ImagePath": "https://images.pexels.com/photos/239581/pexels-photo-239581.jpeg",
        "Ingredients": [
            "100g de farinha de amêndoas",
            "100g de açúcar de confeiteiro",
            "2 claras de ovo (em temperatura ambiente)",
            "50g de açúcar refinado",
            "Corante alimentício (opcional)",
            "Para o recheio:",
            "100g de chocolate branco",
            "50ml de creme de leite"
        ],
        "Instructions": [
            "Preaqueça o forno a 150°C e forre uma assadeira com papel manteiga.",
            "Peneire a farinha de amêndoas e o açúcar de confeiteiro, misturando bem.",
            "Bata as claras em neve e adicione o açúcar refinado aos poucos, batendo até formar picos firmes.",
            "Se desejar, adicione o corante alimentício às claras batidas.",
            "Incorpore delicadamente a mistura de farinha de amêndoas às claras batidas, mexendo com uma espátula até obter uma massa homogênea.",
            "Coloque a massa em um saco de confeitar e faça pequenos círculos na assadeira.",
            "Deixe os macarons descansarem por 20 minutos antes de assar, para que formem uma película.",
            "Asse por 15 a 18 minutos, até que os macarons estejam firmes ao toque.",
            "Enquanto isso, derreta o chocolate branco com o creme de leite para fazer o recheio e deixe esfriar.",
            "Depois que os macarons esfriarem, recheie-os com o creme de chocolate branco.",
            "Monte os macarons, unindo duas conchas com o recheio, e sirva."
        ],
        "New": false,
        "UserId": "654321"
    },
    {
        "Id": "4",
        "Name": "Saladinha fresca de tomate, cebola roxa e manjericão",
        "Description": "Uma salada simples e refrescante, perfeita como acompanhamento ou entrada, com tomates maduros, cebola roxa e folhas frescas de manjericão.",
        "CategoryIds": ["6"],
        "ImagePath": "https://images.pexels.com/photos/3650/salad-tomatoes.jpg",
        "Ingredients": [
            "2 tomates grandes cortados em fatias",
            "1 cebola roxa pequena fatiada",
            "1/4 de xícara de folhas de manjericão fresco",
            "2 colheres de sopa de azeite de oliva",
            "1 colher de sopa de vinagre balsâmico",
            "Sal e pimenta a gosto"
        ],
        "Instructions": [
            "Em uma tigela, misture as fatias de tomate e cebola roxa.",
            "Adicione as folhas de manjericão fresco por cima.",
            "Em um recipiente pequeno, misture o azeite de oliva, o vinagre balsâmico, sal e pimenta para fazer o molho.",
            "Regue a salada com o molho, misturando delicadamente para que os ingredientes fiquem bem temperados.",
            "Sirva imediatamente como acompanhamento ou entrada."
        ],
        "New": true,
        "UserId": "123456"
    },
    {
        "Id": "5",
        "Name": "Ovos pochê no molho de tomate",
        "Description": "Ovos pochê delicadamente cozidos em um molho de tomate saboroso, perfeito para um café da manhã reconfortante ou brunch.",
        "CategoryIds": ["2"],
        "ImagePath": "https://images.pexels.com/photos/691114/pexels-photo-691114.jpeg",
        "Ingredients": [
            "2 ovos",
            "1 xícara de molho de tomate caseiro ou de sua preferência",
            "1/4 de xícara de pimentão fatiado",
            "1/4 de cebola picada",
            "1 dente de alho picado",
            "2 colheres de sopa de azeite de oliva",
            "Sal e pimenta a gosto",
            "Folhas de manjericão fresco para decorar",
            "Pão para acompanhar (opcional)"
        ],
        "Instructions": [
            "Aqueça o azeite de oliva em uma frigideira e refogue a cebola, o alho e os pimentões até que fiquem macios.",
            "Adicione o molho de tomate e tempere com sal e pimenta a gosto. Deixe cozinhar em fogo baixo por cerca de 10 minutos, para que os sabores se incorporem.",
            "Enquanto o molho cozinha, prepare os ovos pochê: em uma panela pequena, ferva água e depois reduza para fogo baixo. Quebre cada ovo em uma tigela pequena e, delicadamente, deslize os ovos para a água. Cozinhe por cerca de 3-4 minutos, até que as claras estejam firmes, mas as gemas ainda estejam moles.",
            "Com cuidado, retire os ovos pochê com uma escumadeira e coloque sobre o molho de tomate.",
            "Decore com folhas de manjericão fresco e sirva com pão torrado, se desejar."
        ],
        "New": false,
        "UserId": "654321"
    },
    {
        "Id": "6",
        "Name": "Talharim ao molho pesto",
        "Description": "Uma massa leve e saborosa servida com um molho pesto fresco de manjericão, pinhões e parmesão.",
        "CategoryIds": ["1"],
        "ImagePath": "https://images.pexels.com/photos/1435896/pexels-photo-1435896.jpeg",
        "Ingredients": [
            "200g de talharim",
            "1/2 xícara de folhas de manjericão fresco",
            "2 colheres de sopa de pinhões",
            "1 dente de alho",
            "1/4 de xícara de queijo parmesão ralado",
            "1/4 de xícara de azeite de oliva",
            "Sal e pimenta a gosto",
            "Pinhões ou nozes picados para decorar (opcional)"
        ],
        "Instructions": [
            "Cozinhe o talharim em água salgada conforme as instruções da embalagem até ficar al dente. Escorra e reserve.",
            "Enquanto a massa cozinha, prepare o molho pesto: em um processador de alimentos, combine o manjericão, os pinhões, o alho e o queijo parmesão. Pulse até formar uma pasta.",
            "Com o processador ligado, adicione o azeite de oliva em fio até que o pesto fique cremoso. Tempere com sal e pimenta a gosto.",
            "Misture o pesto ao talharim cozido até que toda a massa esteja coberta pelo molho.",
            "Decore com pinhões ou nozes picados por cima, se desejar, e sirva imediatamente."
        ],
        "New": false,
        "UserId": "123456"
    },
    {
        "Id": "7",
        "Name": "Morangos com creme de confeiteiro e chantilly",
        "Description": "Uma sobremesa deliciosa e refrescante de morangos frescos servidos com creme de confeiteiro suave e finalizada com chantilly.",
        "CategoryIds": ["4"],
        "ImagePath": "https://images.pexels.com/photos/1132558/pexels-photo-1132558.jpeg",
        "Ingredients": [
            "2 xícaras de morangos frescos cortados ao meio",
            "2 xícaras de leite",
            "4 gemas de ovo",
            "1/2 xícara de açúcar",
            "1/4 xícara de amido de milho (maisena)",
            "1 colher de chá de essência de baunilha",
            "1 xícara de chantilly pronto",
            "Raspas de chocolate branco para decorar (opcional)"
        ],
        "Instructions": [
            "Em uma panela, aqueça o leite até começar a formar pequenas bolhas nas bordas, sem deixar ferver.",
            "Em uma tigela, bata as gemas com o açúcar até obter um creme claro e espesso.",
            "Adicione o amido de milho à mistura de gemas e misture bem.",
            "Despeje lentamente o leite quente sobre a mistura de gemas, mexendo constantemente para evitar que os ovos cozinhem.",
            "Volte a mistura para a panela e cozinhe em fogo médio, mexendo sempre, até engrossar e obter a consistência de um creme.",
            "Retire do fogo e adicione a essência de baunilha. Misture bem.",
            "Transfira o creme de confeiteiro para uma tigela, cubra com filme plástico em contato com o creme para evitar a formação de película, e deixe esfriar completamente.",
            "Distribua os morangos cortados em taças ou em uma travessa.",
            "Despeje o creme de confeiteiro frio sobre os morangos, cobrindo-os completamente.",
            "Adicione uma camada generosa de chantilly por cima do creme.",
            "Decore com raspas de chocolate branco, se desejar, e leve à geladeira por pelo menos 1 hora antes de servir."
        ],
        "New": false,
        "UserId": "654321"
    },
    {
        "Id": "8",
        "Name": "Bolinho de batata com crispy de bacon",
        "Description": "Aperitivo crocante e delicioso, esses bolinhos de batata são fritos até dourar e finalizados com crispy de bacon.",
        "CategoryIds": ["3"],
        "ImagePath": "https://images.pexels.com/photos/166031/pexels-photo-166031.jpeg",
        "Ingredients": [
            "4 batatas grandes",
            "1/2 xícara de farinha de trigo",
            "1 ovo",
            "1/4 de xícara de queijo parmesão ralado",
            "Sal e pimenta a gosto",
            "200g de bacon fatiado",
            "Óleo para fritar"
        ],
        "Instructions": [
            "Cozinhe as batatas até ficarem macias. Descasque e amasse as batatas até formar um purê.",
            "Misture o purê de batata com o ovo, farinha de trigo, queijo parmesão, sal e pimenta a gosto, até formar uma massa homogênea.",
            "Molde a massa em pequenos bolinhos.",
            "Aqueça o óleo em uma panela e frite os bolinhos de batata até dourarem e ficarem crocantes. Escorra em papel toalha.",
            "Em uma frigideira separada, frite as fatias de bacon até ficarem bem crocantes. Deixe esfriar e depois quebre em pedaços pequenos para fazer o crispy de bacon.",
            "Sirva os bolinhos de batata quentes, finalizados com o crispy de bacon por cima."
        ],
        "New": false,
        "UserId": "654321"
    },
    {
        "Id": "9",
        "Name": "Salmão com molho beurre blanc",
        "Description": "Filé de salmão grelhado servido com o clássico molho beurre blanc, feito com manteiga, vinho branco e chalotas, perfeito para um jantar especial.",
        "CategoryIds": ["1"],
        "ImagePath": "https://images.pexels.com/photos/20182311/pexels-photo-20182311/free-photo-of-jantar-janta-refeicao-comida.jpeg",
        "Ingredients": [
            "2 filés de salmão",
            "1/2 xícara de vinho branco seco",
            "2 colheres de sopa de chalotas picadas (ou cebola)",
            "2 colheres de sopa de manteiga",
            "1 colher de sopa de suco de limão",
            "Sal e pimenta a gosto",
            "Azeite de oliva para grelhar",
            "Salsinha picada para decorar (opcional)"
        ],
        "Instructions": [
            "Tempere os filés de salmão com sal e pimenta a gosto.",
            "Aqueça uma frigideira com um fio de azeite de oliva e grelhe os filés de salmão por 4-5 minutos de cada lado, até ficarem dourados e cozidos por dentro. Reserve.",
            "Na mesma frigideira, adicione o vinho branco e as chalotas, cozinhando em fogo baixo até que o líquido reduza pela metade.",
            "Aos poucos, adicione a manteiga em cubos, mexendo constantemente até que derreta e forme um molho cremoso.",
            "Adicione o suco de limão e misture bem.",
            "Despeje o molho beurre blanc sobre os filés de salmão e finalize com salsinha picada por cima, se desejar. Sirva imediatamente."
        ],
        "New": false,
        "UserId": "654321"
    }
]
